barryblueice/ESP32-Haptic-Precision-TouchPad/2.4G/sdkconfig.defaults
    # This file was generated using idf.py save-defconfig. It can be edited manually.
    # Espressif IoT Development Framework (ESP-IDF) 6.0.0 Project Minimal Configuration
    #
    # default:
CONFIG_IDF_TARGET="esp32s2"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_ESP32S2_KEEP_USB_ALIVE=y
CONFIG_ESP_WIFI_BSS_MAX_IDLE_SUPPORT=n
CONFIG_ESP_WIFI_FTM_ENABLE=y
CONFIG_ESP_WIFI_SLP_BEACON_LOST_OPT=y
CONFIG_ESP_WIFI_NAN_SYNC_ENABLE=y
CONFIG_ESP_WIFI_11KV_SUPPORT=y
CONFIG_ESP_WIFI_11R_SUPPORT=y
CONFIG_FREERTOS_HZ=1000
CONFIG_TINYUSB_SUSPEND_CALLBACK=y
CONFIG_TINYUSB_RESUME_CALLBACK=y
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=n
CONFIG_TINYUSB_DESC_CUSTOM_VID=0xd00
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x72d
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="R-SODIUM Technology"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="R-SODIUM Haptic 2.4G Reciever"
CONFIG_TINYUSB_DESC_SERIAL_STRING="0D00072D00000000"
CONFIG_TINYUSB_HID_COUNT=3
